In [15]:
import camelot as cm

In [16]:
ls

'Caesar Cipher.ipynb'               Python_Imaging_Library.ipynb
 data_tables.pdf                    Regular_Expessions.ipynb
 Debugging_python.ipynb             search_sort_algorithms.ipynb
 Enumerate_function.ipynb           set.ipynb
'Extracting Table from PDF.ipynb'   Sierpinski_Triangle.ipynb
 Matplotlib_Basics.ipynb            sierpinski_triangle.png
 Matplotlib_Random_Walk.ipynb       Stacks.ipynb
 my_figure.png                      Strings.ipynb
 Playing_Card_Challenge.ipynb       Two_Sum_Challenge.ipynb
'Playing Card.ipynb'                untitled.txt
 poker.jpg

In [19]:
input_pdf = cm.read_pdf("data_tables.pdf",flavor='lattice',pages='1,2')

In [20]:
input_pdf

In [21]:
for n in input_pdf:
    print(n)

<Table shape=(5, 2)>
<Table shape=(14, 5)>
<Table shape=(6, 2)>

In [25]:
input_pdf[1].df

,0,1,2,3,4
0,Speed (mph),Driver,Car,Engine\nDate,
1,407.447,Craig Breedlove,Spirit of America,GE J47\n8/5/63,
2,413.199,Tom Green,Wingfoot Express,WE J46 \n10/2/64,
3,434.22,Art Arfons,Green Monster,GE J79 \n10/5/64,
4,468.719,Craig Breedlove,Spirit of America,GE J79 \n10/13/64,
5,526.277,Craig Breedlove,Spirit of America,GE J79 \n10/15/65,
6,536.712,Art Arfons,Green Monster,GE J79 \n10/27/65,
7,555.127,Craig Breedlove,"Spirit of America, Sonic 1",GE J79 \n11/2/65,
8,576.553,Art Arfons,Green Monster,GE J79 \n11/7/65,
9,600.601,Craig Breedlove,"Spirit of America, Sonic 1",GE J79 \n11/15/65,
10,622.407,Gary Gabelich,Blue Flame,Rocket \n10/23/70,
11,633.468,Richard Noble,Thrust 2,RR RG 146 \n10/4/83,
12,763.035,Andy Green,Thrust SSC,RR Spey\n10/15/97,
13,,,,,

In [40]:
df = input_pdf[1].df.loc[10:11,1:3]

In [41]:
df

                1           2                    3
10  Gary Gabelich  Blue Flame    Rocket \n10/23/70
11  Richard Noble    Thrust 2  RR RG 146 \n10/4/83

In [42]:
df = df.reset_index(drop = True)

In [43]:
df

               1           2                    3
0  Gary Gabelich  Blue Flame    Rocket \n10/23/70
1  Richard Noble    Thrust 2  RR RG 146 \n10/4/83

In [44]:
df.columns = ["DRIVER", "CAR", "ENGINE"]

In [45]:
df

          DRIVER         CAR               ENGINE
0  Gary Gabelich  Blue Flame    Rocket \n10/23/70
1  Richard Noble    Thrust 2  RR RG 146 \n10/4/83

In [46]:
#if a table has decimal point values , they can be converted to:
#df.loc[:,["CAR", "ENGINE"]] = df.loc[:,["CAR", "ENGINE"]].astype(float)

In [48]:
#converting pdf file to csv file using pandas

df.to_csv("data_tables_csv.csv")

In [49]:
ls

'Caesar Cipher.ipynb'               poker.jpg
 data_tables_csv.csv                Python_Imaging_Library.ipynb
 data_tables.pdf                    Regular_Expessions.ipynb
 Debugging_python.ipynb             search_sort_algorithms.ipynb
 Enumerate_function.ipynb           set.ipynb
'Extracting Table from PDF.ipynb'   Sierpinski_Triangle.ipynb
 Matplotlib_Basics.ipynb            sierpinski_triangle.png
 Matplotlib_Random_Walk.ipynb       Stacks.ipynb
 my_figure.png                      Strings.ipynb
 Playing_Card_Challenge.ipynb       Two_Sum_Challenge.ipynb
'Playing Card.ipynb'                untitled.txt

In [50]:
#converting pdf file to excel file using pandas
df.to_excel("data_tables.xlsx")

In [51]:
ls

'Caesar Cipher.ipynb'               poker.jpg
 data_tables_csv.csv                Python_Imaging_Library.ipynb
 data_tables.pdf                    Regular_Expessions.ipynb
 data_tables.xlsx                   search_sort_algorithms.ipynb
 Debugging_python.ipynb             set.ipynb
 Enumerate_function.ipynb           Sierpinski_Triangle.ipynb
'Extracting Table from PDF.ipynb'   sierpinski_triangle.png
 Matplotlib_Basics.ipynb            Stacks.ipynb
 Matplotlib_Random_Walk.ipynb       Strings.ipynb
 my_figure.png                      Two_Sum_Challenge.ipynb
 Playing_Card_Challenge.ipynb       untitled.txt
'Playing Card.ipynb'

In [52]:
import pandas as pd

In [54]:
df2 = pd.read_csv('data_tables_csv.csv')
df2

   Unnamed: 0         DRIVER         CAR               ENGINE
0           0  Gary Gabelich  Blue Flame    Rocket \n10/23/70
1           1  Richard Noble    Thrust 2  RR RG 146 \n10/4/83

In [55]:
#importing seaborn for data visualization
import seaborn as sns

In [58]:
# converting a data frame from a wide format to a long format using pandas function called melt
df_melted = df.melt('DRIVER',var_name='model', value_name='type of engine')

In [59]:
df_melted

          DRIVER   model       type of engine
0  Gary Gabelich     CAR           Blue Flame
1  Richard Noble     CAR             Thrust 2
2  Gary Gabelich  ENGINE    Rocket \n10/23/70
3  Richard Noble  ENGINE  RR RG 146 \n10/4/83

In [ ]:
# ploting a barplot using seaborn
sns.barplot(x = 'DRIVER', y = "type of engine", hue = 'model', data = df_melted)